In [23]:
import pandas as pd
income = pd.read_excel('../data/raw/income.xlsx')
income = income.iloc[585:1047,[0,1,6]]
income.columns = ['SA2_code', 'SA2_name', 'Income Per Person']

In [24]:
import pandas as pd
postcode_SA2 = pd.read_csv('../data/raw/postcode_SA2.csv')
postcode_SA2 = postcode_SA2[['POSTCODE', 'SA2_MAINCODE_2011', 'SA2_NAME_2011']]
postcode_SA2 = postcode_SA2.rename(columns={'POSTCODE' : 'Postcode', 'SA2_MAINCODE_2011' : 'SA2_code', 'SA2_NAME_2011' : 'SA2_name'})
postcode_SA2 = postcode_SA2.iloc[1763:3207]
income_postcode = pd.merge(postcode_SA2, income, how='left', on=['SA2_name', 'SA2_name'])
income_postcode = income_postcode[['Postcode','Income Per Person']]
income_postcode.to_csv('../data/curated/income.csv')
income

       SA2_code             SA2_name Income Per Person
585   201011001            Alfredton              7989
586   201011002             Ballarat              7595
587   201011003     Ballarat - North             13598
588   201011004     Ballarat - South             12722
589   201011005            Buninyong              4249
...         ...                  ...               ...
1042  217031476                Otway              2360
1043  217041477         Moyne - East              4081
1044  217041478         Moyne - West              5852
1045  217041479  Warrnambool - North             13157
1046  217041480  Warrnambool - South              8052

[462 rows x 3 columns]

In [25]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

income = pd.read_excel('../data/raw/income.xlsx')

income = income.iloc[585:1047,[0,1,22,23,24,25,26]]

income.columns = ['SA2_code','SA2_name','2014','2015','2016','2017','2018']

income

       SA2_code             SA2_name   2014   2015   2016   2017   2018
585   201011001            Alfredton  56374  57747  60026  62315  63668
586   201011002             Ballarat  67217  72754  71895  74671  77876
587   201011003     Ballarat - North  53017  54660  56067  59786  60367
588   201011004     Ballarat - South  45473  46143  47676  49041  50778
589   201011005            Buninyong  58011  58292  60009  61565  63258
...         ...                  ...    ...    ...    ...    ...    ...
1042  217031476                Otway  40640  42426  44236  44755  46448
1043  217041477         Moyne - East  48627  47031  49104  50652  55573
1044  217041478         Moyne - West  48280  50307  51459  52080  55547
1045  217041479  Warrnambool - North  50513  50939  52090  59812  56099
1046  217041480  Warrnambool - South  50663  50965  53226  54849  58247

[462 rows x 7 columns]

In [26]:
postcode_SA2 = pd.read_csv('../data/raw/postcode_SA2.csv')

postcode_SA2 = postcode_SA2[['POSTCODE', 'SA2_MAINCODE_2011', 'SA2_NAME_2011']]

postcode_SA2 = postcode_SA2.rename(columns={'POSTCODE' : 'Postcode', 'SA2_MAINCODE_2011' : 'SA2_code', 'SA2_NAME_2011' : 'SA2_name'})

postcode_SA2 = postcode_SA2.iloc[1763:3207]

income_postcode = pd.merge(postcode_SA2, income, how='left', on='SA2_name')

income_postcode = income_postcode[['Postcode', '2014', '2015', '2016', '2017', '2018']]

income_postcode = income_postcode.fillna(40000)
income_postcode = income_postcode[['Postcode', '2018']]
income_postcode.to_csv('../data/curated/income.csv')

In [27]:
income_postcode = income_postcode[['Postcode', '2018']]
income_postcode = income_postcode.groupby(['Postcode']).mean()
income_postcode

                   2018
Postcode
3000       76708.000000
3002      132130.000000
3003       66723.000000
3004      105672.833333
3005       71476.000000
...                 ...
3990       49340.000000
3991       49340.000000
3992       49340.000000
3995       49340.000000
3996       48215.000000

[696 rows x 1 columns]

In [28]:
income_postcode.to_csv('../data/curated/income.csv')